clear;
a=zeros(1,10);
for num =1:10
    % 程 序 参 数 设 定
    % 数 据
    Coord = ... % 城 市 的 坐 标 Coordinates
   [53.7121 51.1758 46.3253 30.3313 56.5432 10.8198 22.7891 10.1584 20.1050 1.9451 26.4951 31.4847 26.2418 44.0356 28.9836 38.4722 28.2694 32.1910 36.4863 0.9718 8.9586 16.5618 10.5597 50.2111 8.1519 22.1075 0.1215 48.2077 31.9499 0.7732 47.4134 41.8671 43.5474 53.3524 30.8165 27.7133 23.9222 51.9612 12.7938 4.9568 21.5051 15.2548 6.2070 49.2430 17.1168 34.1688 9.4402 11.5812 52.1181 9.5559 24.4509 26.7213 37.5848 35.6619 24.4654 0.7775 14.4703 19.8660 3.1616 18.5245 58.6849 39.5168 56.5089 52.5211 38.4300 51.8181 8.9983 50.1156 13.7909 34.0574 23.0624 19.9857 40.8801 58.8289 18.6635 52.8423 39.9494 47.5099 10.1121 28.7812 8.0831 9.1556 53.7989 33.6490 1.3496 49.9816 19.3635 36.9545 15.7320 11.5118 44.0398 39.7139 6.9909 38.3392 24.6543 36.9980 4.1591 40.1400 23.9876 41.1084;
    15.3046 0.0322 28.2753 6.9348 21.4188 16.2529 23.1045 12.4819 15.4562 0.2057 22.1221 8.9640 18.1760 13.5401 25.9879 20.1731 29.0011 5.8699 29.7284 28.1477 24.6635 23.6143 15.1178 10.2944 9.5325 18.5569 18.8726 16.8889 17.6309 0.4656 23.7783 3.5667 3.9061 26.7256 13.4595 5.0706 7.6306 22.8511 15.7307 8.3669 24.0909 27.2111 5.1442 16.7044 20.0354 22.7571 3.9200 14.5677 0.4088 11.4219 6.5634 28.5667 16.8474 9.9333 3.1644 6.9576 13.6368 15.1224 4.2428 14.3598 27.1485 16.9371 13.7090 15.7957 8.4648 23.0159 23.6440 23.7816 1.9510 23.3960 8.4319 5.7902 14.2978 14.5229 6.7436 27.2880 29.5114 24.0664 27.2662 27.6659 27.6705 14.1304 0.2199 0.3980 16.8359 6.0828 17.6622 23.0265 19.5697 17.3884 16.2635 28.4203 23.1804 19.9950 19.6057 24.3992 3.1853 20.3030 9.4030 27.7149];
  
    t0 = 2 ; % 初 温 t0  【可改动，增加t0可以提高精确度，但会增加运算时间，需要同步修改循环结束条件】
    iLk = 20 ; % 内 循 环 最 大 迭 代 次 数 iLk
    oLk = 50 ; % 外 循 环 最 大 迭 代 次 数 oLk
    lam = 0.95 ; % λ lambda  【可改动，lambda为降温速度，越接近1，降温越慢越精确，增加运算时间】
    istd = 0.001 ; % 若 内 循 环 函 数 值 标 准 差 小 于 istd 则 停 止 【不用修改】
    ostd = 0.001 ; % 若 外 循 环 函 数 值 标 准 差 小 于 ostd 则 停 止  【不用修改】
    ilen = 5 ; % 内 循 环 保 存 的 目 标 函 数 值 个 数
    olen = 5 ; % 外 循 环 保 存 的 目 标 函 数 值 个 数

    % 程 序 主 体
    m = length( Coord ) ; % 城 市 的 个 数 m % 语法：length 返回数组行列中最大值，相当于max(size(A))
    fare = distance( Coord ) ; % 路 径 费 用 fare
    path = 1 : m ; % 初 始 路 径 path
    pathfar = pathfare( fare , path ) ; % 路 径 费 用 pathfare
    ores = zeros( 1 , olen ) ; % 外 循 环 保 存 的 目 标 函 数 值  5 个
    e0 = pathfar ; % 能 量 初 值 e0
    t = t0 ; % 温 度 t
    for out = 1 : oLk % 外 循 环 模 拟 退 火 过 程 ， 此时为50
        ires = zeros( 1 , ilen ) ; % 内 循 环 保 存 的 目 标 函 数 值，5 个
        for in = 1 : iLk % 内 循 环 模 拟 热 平 衡 过 程
            [ newpath , ~ ] = swap( path , 1 ) ; % 随 机 产 生 新 状 态 , 返回｛1｝条新路径和交换后的位置
            e1 = pathfare( fare , newpath ) ; % 新 状 态 能 量
            % Metropolis 抽 样 稳 定 准 则
            r = min( 1 , exp( - ( e1 - e0 ) / t ) ) ; % 新能量小于原能量时，接受此变化，取r=1
            if rand < r  % rand生成随机数，接受变化一定进入此条件语句，不接受变化小概率进入此语句【精髓】
                path = newpath ; % 更 新 路径
                e0 = e1 ;  %更新能量情况
            end
            ires = [ ires( 2 : end ) e0 ] ; % 保 存 新 状 态 能 量，删除数组第一个值保存新能量到尾部
            if std( ires , 1 ) < istd   % 内循环终止准则 ，连续ilen个状态能量波动（标 准 差）小于istd【可改为温度条件】
                break ;
            end
        end
        ores = [ ores( 2 : end ) e0 ] ; % 保 存 新 状 态 能 量
        % 外 循 环 终 止 准 则 ：连 续 olen 个 状 态 能 量 波 动（标准差） 小 于 ostd 【可改为温度条件】
        if std( ores , 1 ) < ostd
            break ;
        end
        t = lam * t ;  %温度每次降低0.95倍
    end
    pathfar = e0 ;
    a(num) = pathfar;
end

disp('近似最短路径为：');
disp(min(a) ) ;
myplot( path , Coord , min(a) ) ;
% 查看参数：最短路线：ptah，最短路程：a