%#############################################################
                                              %是多变量线性规划
%#############################################################
% x1,x2,x3,x4,x5分别表示工程1,2,3,4,5
% max y=20x1+40x2+20x3+15x4+30*x5
% 5x1+4x2+3x3+7x4+8*x5<=25
% 1x1+7x2+9x3+4x4+6*x5<=25
% 8x1+10x2+2x3+1x4+10*x5<=25
% xi=[0 1];(i=1,2 ,3,4,5)
% 整数规划问题

f=-[20 40 20 15 30];
A=[5 4 3 7 8;1 7 9 4 6;8 10 2 1 10];
b=[25;25;25];
intcon=[1 2 3 4 5];
lb=zeros(5,1);
ub=ones(5,1);
[x ,fm]=intlinprog(f,intcon,A,b,[],[],lb,ub);
disp('x = ')
disp(x)
disp('value = ')
disp(fm)
% linprog 线性规划，int+linprog 整数规划 
%【注意 ：linprog求的都是最小值，注意系数矩阵的符号】
% f 是求极小值目标值，intcon 是intlinprog特有参数，表示整数变量的位置
% A*x<=b，Aeq*x<=beq，lb设定每个变量最小值，ub设定每个变量最大值
% x 是求解矩阵，fm 是目标值
%#############################################################
                                       %单变量非线性规划（min）
%#############################################################
 [x,fval,exitflag,output]=fminbnd('(x^3+cos(x)+x*log(x))/exp(x)',0,1);
 %fminbnd(字符串方程，变量最小值，变量最大值)
 %#############################################################
                                        %无约束非线性规划（min）
%#############################################################
%方法1，利用fminsearch函数
fun='64516/x(1)-x(1)/tan(x(2)*pi/180)+2*x(1)/sin(x(2)*pi/180)';
x0=[25,45]; %初始点
[xopt,fopt]=fminsearch(fun,x0); %需要给出原方程和初始迭代点
%xopt为变量矩阵，fopt为目标值
%方法2，利用fminunc函数（效果类似，但需要额外写函数文件，见约束非线性规划文件）
