clear;
x  =[129.0  140.0  103.5  88.0  185.5  195.0  105.5 157.5  107.5  77.0  81.0  162.0  162.0  117.5 ];
y =[ 7.5  141.5  23.0  147.0  22.5  137.5  85.5      -6.5  -81  3.0  56.5  -66.5  84.0  -33.5 ];
z =[ 4  8  6  8  6  8  8  9  9  8  8  9  4  9 ];
x1=75:1:200;
y1=-50:1:150;
[x1,y1]=meshgrid(x1,y1);
figure(1)
z1=griddata(x,y,z,x1,y1,'cubic');  % v4 是matlab提供的独有插值方法，效果最好
% 其余插值方法：最邻近插值 nearest ， 双线性插值 linear ， 双三次插值 cubic ，
meshc(x1,y1,z1) % meshc 显示等高线
figure(2)
z1=griddata(x,y,z,x1,y1,'v4');
meshc(x1,y1,z1)